Revit 2027 API
LinkNode.SymbolId Property
 Identifies the Id of the symbol associated with the node.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SymbolId { get; }
Public ReadOnly Property SymbolId As ElementId
	Get
public:
property ElementId^ SymbolId {
	ElementId^ get ();
}
member SymbolId : ElementId with get
Property Value
ElementId
See Also
Reference
LinkNode Class
Autodesk.Revit.DB Namespace